{
  "on_start_text": "Привет! Я бот для поиска менторов! Загрузи резюме или заполни анкету, чтобы наша нейросеть подобрала тебе ментора ",
  "start_text": "Привет! Пожалуйста, выбери стэк, который тебя интересует",
  "mentors_list_btn_text": "Список менторов",
  "mentors_by_speciality_text": "Менторы по специализации: ",
  "no_mentors_text": "К сожалению, в данный момент нет менторов по этой специализации",
  "mentor_info_text": "Информация о менторе",
  "specific_speciality_text": "Напиши специализацию, чтобы узнать о менторах",
  "quizz_0": "Для того, чтобы мы могли подобрать вам ментора, пожалуйста, ответьте на несколько вопросов. Если вы готовы, отправьте слово 'ок' в ответ на это сообщение",
  "quizz_1": "Что вы хотите получить от менторства? (повышение квалификации, смена работы, подготовка к собеседованиям и т.д.)",
  "quizz_2": "Какие конкретные навыки или знания вы хотите развить?",
  "quizz_3": " Каких результатов вы ожидаете в итоге?",
  "quizz_4": "Текущий уровень знаний и опыта: В какой области IT вы работаете сейчас?",
  "quizz_5": "С какими задачами вы уже справлялись в своей сфере?",
  "quizz_6": "Каков ваш опыт работы в этой сфере?",
  "quizz_7": "Какие технологии вы уже знаете на уровне продвинутого пользователя?",
  "quizz_8": "Какие технологии вы хотите изучить?",
  "quizz_9": "Предпочтения по ментору: Какая специализация ментора вас интересует больше всего?",
  "quizz_10": "Какой опыт работы у ментора должен быть?",
  "quizz_11": "Предпочитаете ли вы ментора с академическим образованием или большим практическим опытом?",
  "quizz_12": "Важны ли для вас отзывы других пользователей о менторе?  Какие критерии в отзывах кажутся вам важными для выбора? (например, отзывчивость, профессионализм, умение объяснять).",
  "quizz_13": "Доступность и формат работы: Какая форма менторства вам подходит больше всего (онлайн, офлайн, комбинированный формат)?",
  "quizz_14": "Какова оптимальная длительность одной сессии, чтобы вы успевали усвоить информацию, но не чувствовали перегрузку?",
  "quizz_15": "Какая частота встреч вам подходит?",
  "quizz_16": "Каков ваш бюджет на менторство?",
  "quizz_17": "Дополнительные вопросы: Есть ли у вас какие-то вопросы к ментору перед началом работы?",
  "did_you_choose_mentor": "В предыдущем сообщении я прислал список менторов, напишите вам понравился кто-то из них?",
  "thanks_for_answers": "Спасибо за обращение, до свидания! Мы будем очень благодарны, если вы пришлете отзыв после общения с ментором! \n Обязательно укажите ник ментора в сообщении",
  "give_me_a_second": "Файл успешно загружен, дайте мне немного времени на обработку"
}
